# Introduction to python

## Session 4

## Contents

### 1. Introduction. Data Frames. CSV and Excel files. Average, max, min, etc.

### 2. Indexing. Queries.

### 3. Time Series. Resample.

### 4. Exercises

## 1. Introduction. Data Frames. CSV and Excel files. Average, max, min, etc.

___pandas___ is a python library with functions and tools for data analysis. 

It provides means to handle series and tables of data, make calculations with them, select data based on criteria and save the results to files.

A simple example of pandas usage is reading a table of data from an excel or csv file, select some rows and columns and calculate the average value.

More complicated examples include creating new tables based on the previous data, and also working with time. An example would be to calculate the daily (or hourly, monthly) average (or sum, or maximum value) of a value from of a high number of measurements, perhaps each minute or 5 minutes.

The following examples refer to measurements on different nutrients in an experiment with lettuce. They will help us to practice the `pandas` usage.

There are three different treatments, with different amounts of nitrogen as nitrate and ammonium, as well as the amount of other elements. The measurements are what was present in the lettuce at the end of the cultivation cycle. This is the kind of data that we often need to group by categories, and where we might want to calculate averages or sums for each group.

Later, in the last part of the present session we will use climate data to give an example of the use of ___time series___, which is data that is not in categories or groups, but rather in points ordered in time, events that happen one after the other.

#### Import the pandas library

It is a common practice to import pandas using the alias ___pd___, like this:

In [1]:
import pandas as pd

From there, the package can be used with `pd.` + the name of the function (dot operator `.`)

For example, to access a `read_csv` function we can write `pd.read_csv`.

Of course it is possible to just `import pandas` and then use `pandas.read_csv`, it makes no difference.

#### Read a table from a file

We will show how to import data from two common file types: ___comma-separated values___ and ___excel___ files.

#### Reading a csv-file

<img src='img/csv_file.png' width='700'>

csv files are raw-text files that separate columns in a table by using a previously defined character, most commonly a comma `,`

Note however, that other characters might be used. For example, Microsoft Excel uses a semicolon `;` when it saves a sheet as csv file!

(like in the example shown)

We can read csv files using the `read_csv` function from pandas. The function's most important argument is the file name:

In [2]:
df_nutrients = pd.read_csv( 'data/nutrients.csv', sep=';' )

Note that by default, the function looks for ___comma___ separated files `,`, which is not the case in the file shown (created with excel). 

Therefore it is necessary to use the parameter `sep=';'` to indicate that, in this case, the columns are separated by semicolon characters.

The function `pd.read_csv` returns a ___Data Frame___, which is the most used data type for tables.

In [3]:
type( df_nutrients )

pandas.core.frame.DataFrame

Inside the Data Frame that was created, `df_nutrients` in this example, we have the content of the file, in rows and columns:

In [4]:
df_nutrients

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,all in (g)
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.48748702529,24398.428146034,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.8993926275,19296.3288426945,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.13032705656,15865.5454860459,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.28810098257,22660.4840070055,301.044988,25.868277,NaN

Note that pandas:
* tries to use the data in the first row as column names (in this case this is correct)
* adds a column at the beginning, with numbers: that is the ___index___ of all rows
* infers the data type of each column: text, numbers... (this fails if there are mixed types)
* adds a value of __NaN__ (not-a-number) to empty cells

#### Reading an xlsx-file from Microsoft Excel

Microsoft Excel is a widespread software for working with data tables, therefore it is very useful to import this kind of files into pandas.

The main difference from csv files to take into account is that excel files can contain several different sheets, and we need to specify which one we want to read to a single table, to a single pandas Data Frame object.

<img src='img/excel_file.png' width='700'>

We will import the sheet "Nutrients", which has the same values that we had previously from the csv file.

In [5]:
# df_nutrients = pd.read_csv( 'data/nutrients.csv', ';' ) → how we read a csv file previously

df_nutrients_xlsx = pd.read_excel( 'data/lettuce.xlsx', sheet_name='Nutrients' )

In [6]:
df_nutrients_xlsx

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,all in (g)
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.535500,22010.605000,222.039645,23.661832,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,1635.416000,18548.592500,278.241845,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,1383.341750,16853.247500,238.926895,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.819735,26337.730109,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.018639,21585.573276,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.487487,24398.428146,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.899393,19296.328843,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.130327,15865.545486,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.288101,22660.484007,301.044988,25.868277,NaN

#### Having a look at a DataFrame

There are a number of functions that can be used directly on a DataFrame and that help to have information from the data inside. 

We will show some of the most common in the next cells.

#### Head and tail

`.head()` shows the first rows in the table, while `.tail()` shows the last ones.

In [7]:
df_nutrients.head()

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,all in (g)
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN

In [8]:
df_nutrients.tail()

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,all in (g)
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.48748702529,24398.428146034,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.8993926275,19296.3288426945,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.13032705656,15865.5454860459,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.28810098257,22660.4840070055,301.044988,25.868277,NaN

By default, they show 5 rows, but a number can be passed as parameter:

In [9]:
df_nutrients.head( 2 )

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,all in (g)
0,3,Control,18761.904841,10306.002208,29067.27250,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.64285,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN

#### Shape

`.shape` prints the number of rows and columns in the table, very useful to check that the data was imported correctly.

In [10]:
df_nutrients.shape

(9, 12)

#### Columns

`.columns` gives the names of the columns in the table

In [11]:
df_nutrients.columns

Index(['Tank', 'Treatment', 'NitrateN', 'AmmoniumN', 'TotalN', 'Phosphorus',
       'Potassium', 'Magnesium', 'Calcium', 'Iron', 'Boron', 'all in (g)'],
      dtype='object')

It can also be used to change the name of a column:

In [12]:
df_nutrients.columns = [ 'Tank', 'Treatment', 'NitrateN', 'AmmoniumN', 'TotalN', 'Phosphorus',
       'Potassium', 'Magnesium', 'Calcium', 'Iron', 'Boron', 'New Column Name' ]

In [13]:
df_nutrients.head()

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN

#### Describe

`.describe()` returns a table with descriptive statistics for all columns in the table, also useful to spot potential errors.

In [14]:
df_nutrients.describe()

,Tank,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Iron,Boron,New Column Name
count,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,0.0
mean,5.000000,20220.235622,12541.972269,32664.723186,10626.614301,43889.134718,277.788409,26.726355,NaN
std,2.738613,2018.980368,1553.319989,2956.945396,1768.905204,2481.705710,36.436523,3.731827,NaN
min,1.000000,16838.258788,10306.002208,27469.952475,6988.360757,40841.131830,222.039645,19.138933,NaN
25%,3.000000,18761.904841,11967.706838,31557.012725,10355.950873,42136.987241,257.110626,25.003664,NaN
50%,5.000000,20802.809014,12437.070289,33770.053475,10672.216286,43390.354388,278.240000,27.742095,NaN
75%,7.000000,21645.354288,13936.716929,34281.496650,11491.501873,46268.123502,301.044988,29.377145,NaN
max,9.000000,22563.040451,15013.877702,36648.984274,12684.874373,47207.997883,335.542442,31.025050,NaN

It is also possible to check those same descriptive statistics separately.

For example, we can get the mean only, without having the other values:

In [15]:
df_nutrients.mean()

Tank                   5.000000
NitrateN           20220.235622
AmmoniumN          12541.972269
TotalN             32664.723186
Phosphorus         10626.614301
Potassium          43889.134718
Iron                 277.788409
Boron                 26.726355
New Column Name             NaN
dtype: float64

Note that:
* the tank is a categorical value (it is not a _number_ of tanks: could have been tank A, B, etc.), but ___pandas___ calculates the statistics all the same
* the column `treatment` is not included, because it has text values (could have been the same with the `tank` column)
* there is an empty column at the end of the table, which gets a count value of 0, as there are no cells with any value there

Here the complete table again, for reference only:

In [16]:
df_nutrients

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.48748702529,24398.428146034,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.8993926275,19296.3288426945,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.13032705656,15865.5454860459,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.28810098257,22660.4840070055,301.044988,25.868277,NaN

## 2. Indexing. Queries.

Having some general data about the whole table is an important step of data exploration, because we can get a feeling of what is happening (what is big, what is missing), and also because it helps to spot possible errors in calculations.

However, it is most common that we want to answer questions like:
* What are the average nutrients _per treatment_?
* Which tanks were used for the Control treatment?
* What is the ratio of ammonium/nitrate for the control treatment?

This kind of questions require that we _select_ some rows and columns before asking for means or sums. We call this selection ___indexing___, similar to the indexing of lists.

### Indexing

To index lists, and then also data frames, we use square brackets. 

With lists, we use always numeric indexes. 

With data frames we can use colum names and numeric indexes.

#### Short reminder of list indexing

In [17]:
example_list1 = [ 'red', 'blue', 'black', 'yellow' ]

example_list1[ 2 ]

'black'

We read that like "example_list1 in the position 2 is 'black'", 

or "the value of example_list1 in the position 2 is 'black'", 

or "there is a 'black' in the position 2 of example_list1"

In [18]:
example_list2 = [ [ 'red', 'blue', 'black', 'yellow' ],
                  [ 'north', 'south', 'up', 'down' ],
                  [ 'apple', 'banana', 'peach', 'pear' ] ]

In [19]:
example_list2[ 2 ]

['apple', 'banana', 'peach', 'pear']

In [20]:
example_list2[ 2 ][ 1 ]

'banana'

We will use the same syntax with pandas DataFrames, but we will index rows with the index (mostly with numbers) and columns with their name.

### Selecting columns from a data frame in pandas

Our DataFrame with nutrients looks like this:

In [21]:
df_nutrients

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.48748702529,24398.428146034,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.8993926275,19296.3288426945,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.13032705656,15865.5454860459,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.28810098257,22660.4840070055,301.044988,25.868277,NaN

We can select only the nitrates' column with:

In [22]:
df_nutrients[ ['NitrateN'] ]

       NitrateN
0  18761.904841
1  21645.354288
2  16838.258788
3  20802.809014
4  21772.696629
5  17620.295796
6  20342.654221
7  21635.106571
8  22563.040451

Or more than one column at a time...

To select nitrates and ammonium, we use a list of columns:

In [23]:
df_nutrients[ [ 'NitrateN', 'AmmoniumN' ] ]

       NitrateN     AmmoniumN
0  18761.904841  10306.002208
1  21645.354288  12437.070289
2  16838.258788  10632.168232
3  20802.809014  11967.706838
4  21772.696629  11997.356846
5  17620.295796  13936.716929
6  20342.654221  13938.842429
7  21635.106571  15013.877702
8  22563.040451  12648.008949

The syntax select columns uses a list of the columns to be selected:

dataframe_name[ [ column_name_1, column_name_2, ... , column_name_n ] ]

Again, we can use the functions `head`, `tail`, `describe`, `mean`, etc in the selected columns, whether they are one or more:

In [24]:
df_nutrients[ [ 'NitrateN', 'AmmoniumN' ] ].head()

       NitrateN     AmmoniumN
0  18761.904841  10306.002208
1  21645.354288  12437.070289
2  16838.258788  10632.168232
3  20802.809014  11967.706838
4  21772.696629  11997.356846

In [25]:
df_nutrients[ [ 'NitrateN', 'AmmoniumN' ] ].describe()

           NitrateN     AmmoniumN
count      9.000000      9.000000
mean   20220.235622  12541.972269
std     2018.980368   1553.319989
min    16838.258788  10306.002208
25%    18761.904841  11967.706838
50%    20802.809014  12437.070289
75%    21645.354288  13936.716929
max    22563.040451  15013.877702

In [26]:
df_nutrients[ [ 'NitrateN', 'AmmoniumN' ] ].mean()

NitrateN     20220.235622
AmmoniumN    12541.972269
dtype: float64

### Selecting rows from a data frame in pandas

To select rows from a data frame, we need to know ___the exact index___ of that row. In most cases, the index is a list of numbers, so we need the row number.

The index is that column without name, on the far left of the table:

In [27]:
df_nutrients

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN
3,1,Au47,20802.809014,11967.706838,31895.044325,12630.322442,41029.996115,1439.81973474096,26337.7301089178,335.542442,28.949213,NaN
4,6,Au47,21772.696629,11997.356846,33770.053475,10672.216286,47175.575986,1467.01863862725,21585.5732755892,316.188490,29.377145,NaN
5,2,Au47,17620.295796,13936.716929,31557.012725,11265.672917,42896.950847,1502.48748702529,24398.428146034,257.110626,25.003664,NaN
6,7,Au53,20342.654221,13938.842429,34281.496650,9118.485757,47207.997883,1394.8993926275,19296.3288426945,285.840136,31.025050,NaN
7,5,Au53,21635.106571,15013.877702,36648.984274,6988.360757,46268.123502,1730.13032705656,15865.5454860459,265.159355,29.770982,NaN
8,9,Au53,22563.040451,12648.008949,35211.049400,10432.143429,40841.131830,1348.28810098257,22660.4840070055,301.044988,25.868277,NaN

In this case, the index is made up from numbers from 0 to 9, as we can check here:

In [28]:
df_nutrients.index

RangeIndex(start=0, stop=9, step=1)

To select a particular row using the index number, we need the ___index locator___ in the form:
    
    dataframe_name.iloc[ row_number ]

In [29]:
df_nutrients.iloc[ 2 ]

Tank                       8
Treatment            Control
NitrateN             16838.3
AmmoniumN            10632.2
TotalN                 27470
Phosphorus             10356
Potassium            43390.4
Magnesium           1,383.34
Calcium            16,853.25
Iron                  238.93
Boron                19.1389
New Column Name          NaN
Name: 2, dtype: object

However, that is not commonly needed.

More often, we select a group of rows according with a condition in a column. For example, we could select all rows from a certain treatment.

We can select groups of rows using queries, as described below.

### Queries

This section shows how to select the rows of a dataframe that fulfil a logical condition.

The general syntax is:
    
    dataframe_name[ (condition) ]
    
And the form of the _condition_ that we will show here is written as:
    
    dataframe_name[ column ] == value
    
Of course, we can use other logical operators, not only _is equal to_: `==`, `<`, `>`, `<=`, `>=`.

For example, we can select only the _control_ treatment from the nutrient dataframe as follows:

In [30]:
df_nutrients[ df_nutrients['Treatment']=='Control' ] # Get part of a table with a selection rule

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN

Some people like to separate it in two lines, to have a better view of what is happening:

In [31]:
condition = df_nutrients['Treatment']=='Control' # First define the selection rule
df_nutrients[ condition ] # Then get the part of the table

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
1,4,Control,21645.354288,12437.070289,34081.642850,11491.501873,44055.094673,"1,635.42","18,548.59",278.240000,27.742095,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN

The result is exactly the same, feel free to use the form that best fit your needs!

#### More than one logical condition

Sometimes, we need to look for parts of a data frame that fulfil more than one logical condition.

Following with out example, the nutrients in the lettuce experiment, we could look for:
* cases where an element in a treatment falls above or under a certain treshold, for example, cases with low nitrogen in the control treatment
* cases where two elements are above or under a treshold value, like very low values of iron and boron
* cases where a value is outside a range,

Note: In these cases we must use ___bitwise logical operators___, which are & |:
* & → ___and___ → condition 1 & condition2
* | → ___or___ → condition 1 | condition2

In [32]:
df_nutrients[ (df_nutrients['Treatment']=='Control') & (df_nutrients['NitrateN']<20000) ]

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN

Again, we can write the code in one or more lines with the same result.

In [33]:
control_treatment = df_nutrients['Treatment']=='Control' # First condition

low_nitrate = df_nutrients['NitrateN']<20000 # Second condition

df_nutrients[ control_treatment & low_nitrate ]

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN

Another example: Select the rows with low Iron or low Boron

In [34]:
low_iron = df_nutrients['Iron']<250 # First condition

low_boron = df_nutrients['Boron']<20 # Second condition

df_nutrients[ low_iron | low_boron ]

,Tank,Treatment,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
0,3,Control,18761.904841,10306.002208,29067.272500,12684.874373,42136.987241,1504.5355,22010.605,222.039645,23.661833,NaN
2,8,Control,16838.258788,10632.168232,27469.952475,10355.950873,43390.354388,"1,383.34","16,853.25",238.930000,19.138933,NaN

#### Calculate on part of a data frame

After selecting part of a data frame we can make calculations, like the average of a treatment.

In [35]:
control_selection = df_nutrients[ 'Treatment' ] == 'Control' # Selection condition
# print( control_selection ) # You can activate this line if you feel curious about what is inside that list

In [36]:
df_nutrients[ control_selection ].describe()

,Tank,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Iron,Boron,New Column Name
count,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,0.0
mean,5.000000,19081.839305,11125.080243,30206.289275,11510.775707,43194.145434,246.403215,23.514287,NaN
std,2.645751,2419.464886,1147.860827,3449.874174,1164.581374,973.990501,28.835858,4.303478,NaN
min,3.000000,16838.258788,10306.002208,27469.952475,10355.950873,42136.987241,222.039645,19.138933,NaN
25%,3.500000,17800.081814,10469.085220,28268.612487,10923.726373,42763.670815,230.484823,21.400383,NaN
50%,4.000000,18761.904841,10632.168232,29067.272500,11491.501873,43390.354388,238.930000,23.661833,NaN
75%,6.000000,20203.629564,11534.619261,31574.457675,12088.188123,43722.724531,258.585000,25.701964,NaN
max,8.000000,21645.354288,12437.070289,34081.642850,12684.874373,44055.094673,278.240000,27.742095,NaN

And we can also select several columns, either in a single line:

In [37]:
df_nutrients[ control_selection ][ [ 'NitrateN', 'Iron' ] ].mean()

NitrateN    19081.839305
Iron          246.403215
dtype: float64

or splitting in two lines of code:

In [38]:
interesting_elements = [ 'NitrateN', 'Iron' ]
df_nutrients[ control_selection ][ interesting_elements ].mean()

NitrateN    19081.839305
Iron          246.403215
dtype: float64

Lastly, you can use the function `.groupby()` to get the descriptive statistics of the whole table, but by groups. For example, for each tratment:

In [39]:
df_nutrients.groupby( 'Treatment' ).mean()

,Tank,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Iron,Boron,New Column Name
Treatment,,,,,,,,,
Au47,3,20065.267146,12633.926871,32407.370175,11522.737215,43700.840983,302.947186,27.776674,NaN
Au53,7,21513.600415,13866.909693,35380.510108,8846.329981,44772.417738,284.014827,28.888103,NaN
Control,5,19081.839305,11125.080243,30206.289275,11510.775707,43194.145434,246.403215,23.514287,NaN

In [40]:
df_nutrients.groupby( 'Treatment' ).min()

,Tank,NitrateN,AmmoniumN,TotalN,Phosphorus,Potassium,Magnesium,Calcium,Iron,Boron,New Column Name
Treatment,,,,,,,,,,,
Au47,1,17620.295796,11967.706838,31557.012725,10672.216286,41029.996115,1439.81973474096,21585.5732755892,257.110626,25.003664,NaN
Au53,5,20342.654221,12648.008949,34281.496650,6988.360757,40841.131830,1348.28810098257,15865.5454860459,265.159355,25.868277,NaN
Control,3,16838.258788,10306.002208,27469.952475,10355.950873,42136.987241,"1,383.34","16,853.25",222.039645,19.138933,NaN

There are much more applications and uses of these (and other) pandas functions, but they may be stuff for a more advanced course. This introduction aims at giving you only an idea of what can be done and the first steps to get you started!

## 3. Time Series. Resample.

`pandas` has a very useful set of functions to deal with time series data, that is, data that are ordered in time.

For this introductory tutorial, we will limit ourselves to the following:
* making a time index for a data frame
* selecting rows between times, using `pd.Timestamp`
* using `pd.resample` to calculate averages

We will use data from climate sensors that were measuring automatically inside the lettuce greenhouse.

The data is in another excel file, which we import as follows:

In [41]:
df_climate = pd.read_excel( 'data/climate.xlsx', sheet_name='greenhouse' )

In [42]:
df_climate.head()

   Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
0  4321 2018-04-18 00:00:21       18.53              52.37
1  4322 2018-04-18 00:05:19       18.49              52.44
2  4323 2018-04-18 00:10:19       17.97              55.13
3  4324 2018-04-18 00:15:19       17.58              56.38
4  4325 2018-04-18 00:20:18       17.48              53.81

In [43]:
df_climate.tail()

        Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
10164  14684 2018-05-23 23:35:32       19.27              54.42
10165  14685 2018-05-23 23:40:30       19.24              54.79
10166  14686 2018-05-23 23:45:27       19.22              55.16
10167  14687 2018-05-23 23:50:25       19.19              55.52
10168  14688 2018-05-23 23:55:22       19.19              55.52

We have data measurements in (about) 5-minutes intervales, measuring temperature and relative humidity inside a greenhouse.

The data span from 18th of April until the 24th of May of 2018. We have a little more than one month of data.

Note that the index is numeric. We want to make it time-aware using the data in the ___Date and Time___ column to be able to select rows in time ranges.

For that, we use the function `pd.DatetimeIndex`, and send as argument the column from te table that has the date and time.

In [44]:
df_climate.head()

   Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
0  4321 2018-04-18 00:00:21       18.53              52.37
1  4322 2018-04-18 00:05:19       18.49              52.44
2  4323 2018-04-18 00:10:19       17.97              55.13
3  4324 2018-04-18 00:15:19       17.58              56.38
4  4325 2018-04-18 00:20:18       17.48              53.81

Old index:

In [45]:
df_climate.index

RangeIndex(start=0, stop=10169, step=1)

New index:

In [46]:
df_climate.index = pd.DatetimeIndex( df_climate[ 'Date and Time' ] )

Note: A common source of error in this step is a confusion between days and monts (because of the order). It can also happen with the year, if only the last 2 numbers are written: Which are the day, month and year if the date is __10-11-12__?

For the first case, you can specify if days or months go first:
`df_climate.index = pd.DatetimeIndex( df_climate[ 'Date and Time' ], dayfirst=True, yearfirst=True )`

Now we have the index as a time object and can select rows according with it:

In [47]:
df_climate.head()

                     Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-04-18 00:00:21  4321 2018-04-18 00:00:21       18.53              52.37
2018-04-18 00:05:19  4322 2018-04-18 00:05:19       18.49              52.44
2018-04-18 00:10:19  4323 2018-04-18 00:10:19       17.97              55.13
2018-04-18 00:15:19  4324 2018-04-18 00:15:19       17.58              56.38
2018-04-18 00:20:18  4325 2018-04-18 00:20:18       17.48              53.81

To select a particular day, we can use `pd.Timestamp`.

Let's say we want to check the data of the 23rd of May:

In [48]:
start = pd.Timestamp( '2018-05-23, 00:00:00' )
end = pd.Timestamp( '2018-05-24, 00:00:00' )

In [49]:
condition_start = df_climate.index > start
condition_end = df_climate.index < end

df_climate[ condition_start & condition_end ]

                      Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-05-23 00:00:21  14401 2018-05-23 00:00:21       18.38              58.77
2018-05-23 00:05:19  14402 2018-05-23 00:05:19       18.34              59.22
2018-05-23 00:10:19  14403 2018-05-23 00:10:19       18.30              59.71
2018-05-23 00:15:19  14404 2018-05-23 00:15:19       18.25              60.21
2018-05-23 00:20:18  14405 2018-05-23 00:20:18       18.20              60.66
2018-05-23 00:25:17  14406 2018-05-23 00:25:17       18.15              61.19
2018-05-23 00:30:17  14407 2018-05-23 00:30:17       18.10              61.72
2018-05-23 00:35:16  14408 2018-05-23 00:35:16       18.05              62.18
2018-05-23 00:40:16  14409 2018-05-23 00:40:16       17.99              62.74
2018-05-23 00:45:19  14410 2018-05-23 00:45:19       17.94              63.31
2018-05-23 00:50:21  14411 2018-05-23 00:50:21       17.88              63.82
2018-05-23 00:55:20  14412 2018-05-23 00:55:20       17.84              64.33
2018-05-23 01:00:20  14413 2018-05-23 01:00:20       17.79              64.89
2018-05-23 01:05:20  14414 2018-05-23 01:05:20       17.74              65.45
2018-05-23 01:10:20  14415 2018-05-23 01:10:20       17.69              65.98
2018-05-23 01:15:19  14416 2018-05-23 01:15:19       17.65              66.47
2018-05-23 01:20:18  14417 2018-05-23 01:20:18       17.60              66.95
2018-05-23 01:25:18  14418 2018-05-23 01:25:18       17.55              67.54
2018-05-23 01:30:17  14419 2018-05-23 01:30:17       17.52              68.06
2018-05-23 01:35:17  14420 2018-05-23 01:35:17       17.48              68.58
2018-05-23 01:40:16  14421 2018-05-23 01:40:16       17.44              69.05
2018-05-23 01:45:16  14422 2018-05-23 01:45:16       17.40              69.59
2018-05-23 01:50:15  14423 2018-05-23 01:50:15       17.37              70.02
2018-05-23 01:55:15  14424 2018-05-23 01:55:15       17.34              70.51
2018-05-23 02:00:15  14425 2018-05-23 02:00:15       17.31              70.88
2018-05-23 02:05:14  14426 2018-05-23 02:05:14       17.29              71.28
2018-05-23 02:10:14  14427 2018-05-23 02:10:14       17.26              71.78
2018-05-23 02:15:14  14428 2018-05-23 02:15:14       17.23              72.17
2018-05-23 02:20:13  14429 2018-05-23 02:20:13       17.19              72.49
2018-05-23 02:25:13  14430 2018-05-23 02:25:13       17.15              72.82
...                    ...                 ...         ...                ...
2018-05-23 21:30:31  14659 2018-05-23 21:30:31       19.26              45.67
2018-05-23 21:35:29  14660 2018-05-23 21:35:29       19.28              46.18
2018-05-23 21:40:27  14661 2018-05-23 21:40:27       19.31              46.54
2018-05-23 21:45:26  14662 2018-05-23 21:45:26       19.34              46.81
2018-05-23 21:50:24  14663 2018-05-23 21:50:24       19.38              47.11
2018-05-23 21:55:01  14664 2018-05-23 21:55:01       19.41              47.44
2018-05-23 22:00:03  14665 2018-05-23 22:00:03       19.44              47.74
2018-05-23 22:05:01  14666 2018-05-23 22:05:01       19.46              48.06
2018-05-23 22:10:32  14667 2018-05-23 22:10:32       19.47              48.41
2018-05-23 22:15:30  14668 2018-05-23 22:15:30       19.47              48.75
2018-05-23 22:20:28  14669 2018-05-23 22:20:28       19.47              49.15
2018-05-23 22:25:26  14670 2018-05-23 22:25:26       19.47              49.47
2018-05-23 22:30:24  14671 2018-05-23 22:30:24       19.46              49.83
2018-05-23 22:35:22  14672 2018-05-23 22:35:22       19.46              50.19
2018-05-23 22:40:20  14673 2018-05-23 22:40:20       19.46              50.53
2018-05-23 22:45:18  14674 2018-05-23 22:45:18       19.46              50.84
2018-05-23 22:50:17  14675 2018-05-23 22:50:17       19.46              51.12
2018-05-23 22:55:15  14676 2018-05-23 22:55:15       19.46              51.43
2018-05-23 23:00:13  14677 2018-05-23 23:00:13       19.46              51.78
2018-05-23 23:05:11  14678 2018-05-23 23:05:11       19.44              52.17
2018-05-23 23:10:09  14679 2018-05-23 23:10:09       19.41              52.58
2018-05-23 23:15:07  14680 2018-05-23 23:15:07       19.38              52.90
2018-05-23 23:20:05  14681 2018-05-23 23:20:05       19.36              53.26
2018-05-23 23:25:03  14682 2018-05-23 23:25:03       19.32              53.68
2018-05-23 23:30:01  14683 2018-05-23 23:30:01       19.30              54.06
2018-05-23 23:35:32  14684 2018-05-23 23:35:32       19.27              54.42
2018-05-23 23:40:30  14685 2018-05-23 23:40:30       19.24              54.79
2018-05-23 23:45:27  14686 2018-05-23 23:45:27       19.22              55.16
2018-05-23 23:50:25  14687 2018-05-23 23:50:25       19.19              55.52
2018-05-23 23:55:22  14688 2018-05-23 23:55:22       19.19              55.52

[288 rows x 4 columns]

And we can use this new table to calculate the average (or max, min, etc) of the columns on that interval:

In [50]:
df_climate[ condition_start & condition_end ].mean()

Num.                 14544.500000
Temp. (°C)              23.980278
Rel. Humidity (%)       42.395347
dtype: float64

Of course, we can also look for other periods with this technique, we just follow the steps:
* Define a start time with `pd.Timestamp`
* Define a finishing time with `pd.Timestamp`
* Check condition: > start
* Check condition: < end
* Select from the table (query)

In [51]:
start = pd.Timestamp( '2018-05-23, 08:00:00' )
end = pd.Timestamp( '2018-05-23, 09:00:00' )

condition_start = df_climate.index > start
condition_end = df_climate.index < end

df_climate[ condition_start & condition_end ]

                      Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-05-23 08:00:04  14497 2018-05-23 08:00:04       23.93              39.23
2018-05-23 08:05:03  14498 2018-05-23 08:05:03       24.22              38.60
2018-05-23 08:10:03  14499 2018-05-23 08:10:03       24.50              38.01
2018-05-23 08:15:03  14500 2018-05-23 08:15:03       24.87              37.22
2018-05-23 08:20:03  14501 2018-05-23 08:20:03       25.16              36.96
2018-05-23 08:25:03  14502 2018-05-23 08:25:03       25.38              36.74
2018-05-23 08:30:03  14503 2018-05-23 08:30:03       25.53              36.23
2018-05-23 08:35:03  14504 2018-05-23 08:35:03       25.71              35.84
2018-05-23 08:40:03  14505 2018-05-23 08:40:03       25.88              35.48
2018-05-23 08:45:03  14506 2018-05-23 08:45:03       26.09              35.10
2018-05-23 08:50:03  14507 2018-05-23 08:50:03       26.21              34.29
2018-05-23 08:55:02  14508 2018-05-23 08:55:02       26.29              33.99

This techinque does not look for exact matches, as the measuring times in the table include seconds that are irregular. It is very useful because it also works in cases when there are empty or not equally distributed timestamps.

It is now very easy to know the average temperature in the period between 8 and 9 that we selected previously:

In [52]:
start = pd.Timestamp( '2018-05-23, 08:00:00' )
end = pd.Timestamp( '2018-05-23, 09:00:00' )

condition_start = df_climate.index > start
condition_end = df_climate.index < end

df_sums = df_climate[ condition_start & condition_end ].sum()

#### Resample

Lastly, we will have a quick introduction to `.resample`, a function that allows us to change the interval in which some data are given, either ___upsample___ (get more points, at smaller intervals) or ___downsample___ (agreggating values in bigger intervals).

The data in the climate data frame is stored in intervals of about 5 minutes. 

We will first ___downsample___ it to hourly and daily values.

There are two things that we have to have clear to correctly resample data:

* What the new frequency will be. 1 hour? 15 minutes? 1 day?
* How we will create the new values. Sum? Average?

About the first question, we will use the following letters to specifiy the new frequency:
    
* M → monthly frequency
* W → weekly frequency
* D → daily frequency
* H → hourly frequency
* T → minutely frequency
* S → secondly frequency
* L → milliseonds
* U → microseconds
* N → nanoseconds

About the second question, think that water (liter [L]) from irrigation in the morning and in the afternoon should ___add___ up for a daily value.

On the other hand, the temperature in the morning, and the temperature in the afternoon should be ___averaged___ to give a daily value.

Also, in cases we need the last value, or the first, or the most common in the interval. At the end of this notebook is a link to a very nice post where these options can be consulted.

First we will resample the whole data frame to 1 hour, taking the average of the values in each hourly interval. 

It is like this now:

In [53]:
df_climate.head()

                     Num.       Date and Time  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-04-18 00:00:21  4321 2018-04-18 00:00:21       18.53              52.37
2018-04-18 00:05:19  4322 2018-04-18 00:05:19       18.49              52.44
2018-04-18 00:10:19  4323 2018-04-18 00:10:19       17.97              55.13
2018-04-18 00:15:19  4324 2018-04-18 00:15:19       17.58              56.38
2018-04-18 00:20:18  4325 2018-04-18 00:20:18       17.48              53.81

In [54]:
df_climate_1h = df_climate.resample( '1H' ).mean()

In [55]:
df_climate_1h.head()

                       Num.  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-04-18 00:00:00  4326.5   18.013333          53.595000
2018-04-18 01:00:00  4338.5   18.055833          52.836667
2018-04-18 02:00:00  4350.5   17.971667          51.935833
2018-04-18 03:00:00  4362.5   17.933333          51.635000
2018-04-18 04:00:00  4374.5   18.014167          50.772500

In [56]:
df_climate_1h.tail()

                        Num.  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-05-23 19:00:00  14634.5   22.855000          28.825000
2018-05-23 20:00:00  14646.5   20.790833          36.506667
2018-05-23 21:00:00  14658.5   19.447500          44.990833
2018-05-23 22:00:00  14670.5   19.461667          49.626667
2018-05-23 23:00:00  14682.5   19.315000          53.820000

And now the same for daily values:

In [57]:
df_climate_1d = df_climate.resample( '1D' ).mean()

In [58]:
df_climate_1d.head()

                      Num.  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-04-18     4464.500000   21.353715          47.279514
2018-04-19     4752.447183   21.316585          58.615634
2018-04-20     5042.031802   22.221908          57.677244
2018-04-21     5328.500000   19.976771          54.997917
2018-04-22     5616.500000   20.016562          51.049583

In [59]:
df_climate_1d.tail()

                  Num.  Temp. (°C)  Rel. Humidity (%)
Date and Time
2018-05-19     13392.5   22.091285          48.573750
2018-05-20     13680.5   22.293472          38.786319
2018-05-21     13968.5   21.855174          42.795382
2018-05-22     14256.5   22.901215          42.902083
2018-05-23     14544.5   23.980278          42.395347

And that easily we get the daily average temperature and humidity from measurements in 5 minutes interval!

If we wanted to resample with different functions, sometimes the maximum value, for some other columns the sum or the mean, we need to use the following syntax.

In this case, it resamples to the same 1-day frequency, but it returns the minimum temperature and averages the relative humidity.

Remember to import numpy to use the functions `np.max` and `np.mean`!

In [60]:
import numpy as np

In [61]:
df_climate.resample( '1D' ).apply( {'Temp. (°C)':np.sum,'Rel. Humidity (%)':np.mean} )

               Rel. Humidity (%)  Temp. (°C)
Date and Time
2018-04-18             47.279514     6149.87
2018-04-19             58.615634     6053.91
2018-04-20             57.677244     6288.80
2018-04-21             54.997917     5753.31
2018-04-22             51.049583     5764.77
2018-04-23             58.576408     5617.61
2018-04-24             62.034316     4815.39
2018-04-25             64.354774     4809.80
2018-04-26             64.391706     2567.26
2018-04-27             38.669330     4447.07
2018-04-28             43.108507     5851.46
2018-04-29             45.982465     6592.33
2018-04-30             52.344757     6025.32
2018-05-01             45.780382     5324.67
2018-05-02             45.758299     5138.78
2018-05-03             46.190938     5646.26
2018-05-04             37.508125     5582.16
2018-05-05             39.987500     5748.91
2018-05-06             45.982222     6192.57
2018-05-07             49.766285     6093.85
2018-05-08             49.043924     6298.74
2018-05-09             54.250764     6551.59
2018-05-10             65.714549     6479.49
2018-05-11             76.756111     5332.67
2018-05-12             65.297639     5747.49
2018-05-13             51.287465     6698.29
2018-05-14             42.728750     6662.93
2018-05-15             57.936458     5915.59
2018-05-16             58.533611     6215.47
2018-05-17             58.776111     5983.94
2018-05-18             63.067743     5432.05
2018-05-19             48.573750     6362.29
2018-05-20             38.786319     6420.52
2018-05-21             42.795382     6294.29
2018-05-22             42.902083     6595.55
2018-05-23             42.395347     6906.32

Lastly, we will show what happens if the new frequency is bigger, i.e. the time intervals are smaller.

In these cases, we get empty spaces, that need to be filled with _something_. Common options are the next or last values, or empty cells.

For an example, we will change the frequency from 5 minutes to 1 minute.

Mean, average and other functions that ___aggregate___ values do not have meaning in this case, because we are "creating" new values, cells that were not there before:

In [62]:
df_climate['Temp. (°C)'].resample( '1min' ).ffill()

Date and Time
2018-04-18 00:00:00      NaN
2018-04-18 00:01:00    18.53
2018-04-18 00:02:00    18.53
2018-04-18 00:03:00    18.53
2018-04-18 00:04:00    18.53
2018-04-18 00:05:00    18.53
2018-04-18 00:06:00    18.49
2018-04-18 00:07:00    18.49
2018-04-18 00:08:00    18.49
2018-04-18 00:09:00    18.49
2018-04-18 00:10:00    18.49
2018-04-18 00:11:00    17.97
2018-04-18 00:12:00    17.97
2018-04-18 00:13:00    17.97
2018-04-18 00:14:00    17.97
2018-04-18 00:15:00    17.97
2018-04-18 00:16:00    17.58
2018-04-18 00:17:00    17.58
2018-04-18 00:18:00    17.58
2018-04-18 00:19:00    17.58
2018-04-18 00:20:00    17.58
2018-04-18 00:21:00    17.48
2018-04-18 00:22:00    17.48
2018-04-18 00:23:00    17.48
2018-04-18 00:24:00    17.48
2018-04-18 00:25:00    17.48
2018-04-18 00:26:00    17.99
2018-04-18 00:27:00    17.99
2018-04-18 00:28:00    17.99
2018-04-18 00:29:00    17.99
                       ...
2018-05-23 23:26:00    19.32
2018-05-23 23:27:00    19.32
2018-05-23 23:28:00    19.32
2018-05-23 23:29:00    19.32
2018-05-23 23:30:00    19.32
2018-05-23 23:31:00    19.30
2018-05-23 23:32:00    19.30
2018-05-23 23:33:00    19.30
2018-05-23 23:34:00    19.30
2018-05-23 23:35:00    19.30
2018-05-23 23:36:00    19.27
2018-05-23 23:37:00    19.27
2018-05-23 23:38:00    19.27
2018-05-23 23:39:00    19.27
2018-05-23 23:40:00    19.27
2018-05-23 23:41:00    19.24
2018-05-23 23:42:00    19.24
2018-05-23 23:43:00    19.24
2018-05-23 23:44:00    19.24
2018-05-23 23:45:00    19.24
2018-05-23 23:46:00    19.22
2018-05-23 23:47:00    19.22
2018-05-23 23:48:00    19.22
2018-05-23 23:49:00    19.22
2018-05-23 23:50:00    19.22
2018-05-23 23:51:00    19.19
2018-05-23 23:52:00    19.19
2018-05-23 23:53:00    19.19
2018-05-23 23:54:00    19.19
2018-05-23 23:55:00    19.19
Freq: T, Name: Temp. (°C), Length: 51836, dtype: float64

## 4. Exercises

### 4.1

Consider the fresh weight measurements of the lettuce experiment, included in the excel file ___lettuce.xlsx___, on the sheet ___Freshweight___.

Import the data and select each one of the treatments.

For each treatment, create a data frame. You can call them `df_Au47`, `df_Au53` and `df_Control`.

Once you have three data frames, save each one of them to a ___csv___ file, using the `.to_csv()` function.

You might want to use the optional parameters:
* sep=';' if you plan to read it easily using microsoft excel
* index=False if you don't want an extra column with the index at the beginning of the file

The general syntax is:

`dataframe_name.to_csv( "filename.csv" )`

### 4.2

Open the sheet ___Elements___ in the same excel file to a new data frame. You can call it `df_elements`. 

It contains the use of fertilizers in the lettuce experiment. 

There are several rows for each tank of nutrient solution, and we want to know the descriptive statistics of each tank.

Select the first tank and show its descriptive statistics using either of these forms:

`df_elements[ df_elements['Tank']==1 ].describe()`

`tank_condition = df_elements['Tank']==1`

`df_elements[ tank_condition ].describe()`

Create a for loop that counts from 1 to 9, which are the tank numbers. In the loop, include the code you just used to print the statistics and:
* wrap it in a `print()` function to see the statistics for all tanks
* append the following code to the same line to obtain 9 files with the statistics: `.to_csv(str(i)+'.csv')`
* correct the code from last line to make the files names agree with the tank number

## Links

[Pandas official documentation](https://pandas.pydata.org/pandas-docs/stable/)

[A tutorial on pandas](https://towardsdatascience.com/a-quick-introduction-to-the-pandas-python-library-f1b678f34673)

[Example about row selection on conditions](https://chrisalbon.com/python/data_wrangling/pandas_selecting_rows_on_conditions/)

[Resampling options, frequency and aggregation functions](http://benalexkeen.com/resampling-time-series-data-with-pandas/)

---